In [1794]:
import pandas as pd

In [1796]:
df = pd.read_csv('g13_gaming_players_games_with_tournaments_merged.csv', sep=";")

In [1798]:
df.head(3)

,players_id,games_id,session_date,score,username,level,join_date,title,genre,release_date,tournaments_id,tournament_name,prize_pool
0,1663,165,26/01/2025,523,fullersamantha,70,28/01/2025,center,Strategy,27/09/2010,4,seat,86681
1,1298,21,11/02/2025,916,todd18,45,07/02/2025,trip,Sports,02/11/2000,47,argue,74092
2,198,39,09/02/2025,861,stephen00,8,30/01/2025,company,Sports,28/01/2011,17,film,4319

In [1800]:
df.sort_values('players_id').head(6)

,players_id,games_id,session_date,score,username,level,join_date,title,genre,release_date,tournaments_id,tournament_name,prize_pool
4707,1,78,07/02/2025,109,ehaas,44,01/01/2025,join,Sports,04/02/2013,9,they,36050
4673,1,68,06/02/2025,362,ehaas,44,01/01/2025,husband,Action,25/07/2021,45,human,64942
1285,1,258,25/01/2025,716,ehaas,44,01/01/2025,student,Sports,29/08/2018,18,form,53429
3116,2,212,02/01/2025,0,sharrison,66,21/01/2025,beat,RPG,21/11/2011,8,nice,5582
4354,2,200,05/01/2025,886,sharrison,66,21/01/2025,page,Sports,23/09/2000,23,start,85502
2580,2,26,19/02/2025,181,sharrison,66,21/01/2025,behavior,RPG,17/08/2024,1,price,92322

In [1802]:
Tournament = df.loc[:,['tournaments_id','tournament_name','prize_pool']]

In [1804]:
Tournament.head(3)

   tournaments_id tournament_name  prize_pool
0               4            seat       86681
1              47           argue       74092
2              17            film        4319

In [1806]:
Tournament.columns=['id', 'tournament_name', 'prize_pool']

In [1808]:
len(Tournament['id'].unique())

50

In [1810]:
len(Tournament)

5000

In [1812]:
Tournament.drop_duplicates(subset='id',inplace=True)

In [1814]:
len(Tournament)

50

In [1816]:
Tournament.head(3)

   id tournament_name  prize_pool
0   4            seat       86681
1  47           argue       74092
2  17            film        4319

In [1818]:
from sqlalchemy import create_engine

In [1820]:
engine = create_engine('sqlite:///Grupo3.db')

In [1822]:
Tournament.to_sql('Tournament', con =engine, if_exists='replace', index=False)

50

In [1824]:
engine.dispose()

In [1826]:
Game = df.loc[:,['games_id','genre','title','release_date','tournaments_id']]

In [1828]:
Game.head(3)

   games_id     genre    title release_date  tournaments_id
0       165  Strategy   center   27/09/2010               4
1        21    Sports     trip   02/11/2000              47
2        39    Sports  company   28/01/2011              17

In [1830]:
Game.columns=['id','genre','title','release_date','tournaments_id']

In [1832]:
len(Game['id'].unique())

300

In [1834]:
len(Game)

5000

In [1836]:
Game.drop_duplicates(subset='id',inplace=True)

In [1838]:
len(Game)

300

In [1840]:
Game.head(3)

    id     genre    title release_date  tournaments_id
0  165  Strategy   center   27/09/2010               4
1   21    Sports     trip   02/11/2000              47
2   39    Sports  company   28/01/2011              17

In [1842]:
from sqlalchemy import create_engine

In [1844]:
engine = create_engine('sqlite:///Grupo3.db')

In [1846]:
Game.to_sql('Game', con =engine, if_exists='replace', index=False)

300

In [1848]:
engine.dispose()

In [1850]:
Player = df.loc[:,['players_id','username','level','join_date', 'score']]

In [1852]:
Player.head(3)

   players_id        username  level   join_date  score
0        1663  fullersamantha     70  28/01/2025    523
1        1298          todd18     45  07/02/2025    916
2         198       stephen00      8  30/01/2025    861

In [1854]:
Player.columns=['id','username','level','join_date', 'score']

In [1856]:
len(Player['id'].unique())

1826

In [1858]:
len(Player)

5000

In [1860]:
Player.head(3)

     id        username  level   join_date  score
0  1663  fullersamantha     70  28/01/2025    523
1  1298          todd18     45  07/02/2025    916
2   198       stephen00      8  30/01/2025    861

In [1862]:
from sqlalchemy import create_engine

In [1864]:
engine = create_engine('sqlite:///Grupo3.db')

In [1866]:
Player.to_sql('Player', con =engine, if_exists='replace', index=False)

5000

In [1868]:
engine.dispose()

In [1870]:
Player = df.loc[:,['players_id','username','level','join_date', 'score']]

In [1872]:
Player.head(3)

   players_id        username  level   join_date  score
0        1663  fullersamantha     70  28/01/2025    523
1        1298          todd18     45  07/02/2025    916
2         198       stephen00      8  30/01/2025    861

In [1874]:
Player.columns=['id','username','level','join_date', 'score']

In [1876]:
len(Player['id'].unique())

1826

In [1878]:
len(Player)

5000

In [1880]:
Player.head(3)

     id        username  level   join_date  score
0  1663  fullersamantha     70  28/01/2025    523
1  1298          todd18     45  07/02/2025    916
2   198       stephen00      8  30/01/2025    861

In [1882]:
from sqlalchemy import create_engine

In [1884]:
engine = create_engine('sqlite:///Grupo3.db')

In [1886]:
Game.to_sql('Game', con =engine, if_exists='replace', index=False)

300

In [1888]:
engine.dispose()

In [1890]:
Game_player = df.loc[:,['players_id','games_id']]

In [1892]:
Game_player.insert(0,'id', range(1,len(Game_player)+1))

In [1894]:
Game_player.head(3)

   id  players_id  games_id
0   1        1663       165
1   2        1298        21
2   3         198        39

In [1896]:
Game_player.columns=['id','players_id','games_id']

In [1898]:
Game_player.head(3)

   id  players_id  games_id
0   1        1663       165
1   2        1298        21
2   3         198        39

In [1900]:
from sqlalchemy import create_engine

In [1902]:
engine = create_engine('sqlite:///Grupo3.db')

In [1904]:
Game_player.to_sql('Game_player', con =engine, if_exists='replace', index=False)

5000

In [1906]:
engine.dispose()